Sambulov/COS/Projects/DEMO/MIG/mig_gd32f103vg.c
const hdl_gpio_pin_t mod_gpio_pa9 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_9)
}; //(PA9)

const hdl_gpio_pin_t mod_gpio_pa9_uart_tx = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_pp_mid_mode,
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_9)
}; //(PA9)

const hdl_gpio_pin_t mod_gpio_pa10_uart_rx = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_pp_mid_mode,
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_10)
}; //(PA10)

const hdl_gpio_pin_t mod_gpio_pb6_scl = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_od_slow_mode, 
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_6)
}; //(PB6)

const hdl_gpio_pin_t mod_gpio_pb7_sda = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_alternate_od_slow_mode, 
    .inactive_default = HDL_GPIO_HIGH,
    .pin = GPIO_PIN_7)
}; //(PB7)

const hdl_gpio_pin_t mod_gpio_pb12 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_12)
}; //(PB12)

const hdl_gpio_pin_t mod_gpio_pb13 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_13)
}; //(PB13)

const hdl_gpio_pin_t mod_gpio_pb14 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_14)
}; //(PB14)

const hdl_gpio_pin_t mod_gpio_pb15 = {
  .iface = &hdl_gpio_pin_iface,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t,
    .hwc = &mod_gpio_mode_output_pp, 
    .inactive_default = HDL_GPIO_LOW,
    .pin = GPIO_PIN_15)
}; //(PB15)


/**************************************************************
 *  I2C
 *************************************************************/

hdl_i2c_channel_t i2c0_ch0 = {.address = HDL_I2C_SLAVE_ADDR};

const hdl_i2c_config_t mod_i2c0_cnf = {
  .channels = hdl_i2c_channels(&i2c0_ch0),
  .hwc = hdl_module_config(hdl_i2c_config_hw_t,
    .addr_10_bits = 0,
    .dtcy = I2C_DTCY_2,
    .dual_address = 0,
    .err_interrupt = &mod_irq_i2c0_er,
    .ev_interrupt = &mod_irq_i2c0_ev,
    .general_call_enable = 0,
    .speed = 400000,
    .stretch_enable = 1,
    .rcu = RCU_I2C0,
    .phy = I2C0
  )
};
 
const hdl_i2c_mcu_t mod_i2c0 = {
  .iface = &hdl_i2c_iface,
  .dependencies = hdl_module_dependencies(&mod_gpio_pb6_scl, &mod_gpio_pb7_sda,
                                          &mod_clock_apb1, &mod_nvic, &mod_systick_timer),
  .config = &mod_i2c0_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_I2C_VAR_SIZE)
};

/**************************************************************
 *  SPI
 *************************************************************/

const hdl_spi_client_mcu_t mod_spi0 = {
  .iface = &hdl_spi_client_iface,
  .dependencies = hdl_module_dependencies(&mod_gpio_pa7_mosi, &mod_gpio_pa6_miso, &mod_gpio_pa5_sck,
                                          &mod_clock_apb1, &mod_nvic),
  .config = hdl_module_config(hdl_spi_client_config_t,
    .phy = SPI0,
    .rcu = RCU_SPI0,
    .endian = HDL_SPI_ENDIAN_MSB,
    .polarity = SPI_CK_PL_HIGH_PH_2EDGE,
    .prescale = HDL_SPI_PSC_2,
    .spi_interrupt = &mod_irq_spi_0
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_SPI_CLIENT_VAR_SIZE)
};

const hdl_spi_client_ch_mcu_t mod_spi0_ch0 = {
  .iface = &hdl_spi_client_ch_iface,
  .dependencies = hdl_module_dependencies(&mod_spi0, &mod_gpio_pa4_cs, &mod_systick_counter),
  .config = hdl_module_config(hdl_spi_client_ch_config_t, .cs_min_delay = 90),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_SPI_CLIENT_CH_VAR_SIZE)
};

/**************************************************************
 *  ADC
 *************************************************************/

const hdl_adc_mcu_t mod_adc0 = {
  .iface = &hdl_adc_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_adc, &mod_systick_timer, &mod_dma0_ch0, &mod_nvic),
  .config = hdl_module_config(hdl_adc_config_t,
    .phy = ADC0,
    .rcu = RCU_ADC0,
    .adc_interrupt = &mod_irq_adc0_1,
    .data_alignment = HDL_ADC_DATA_ALIGN_RIGHT,
    .init_timeout = 3000,
    .adc_slots = (uint32_t *)static_malloc(8)
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_ADC_VAR_SIZE)
};

const hdl_adc_ch_mcu_t mod_adc0_ch3 = {
  .iface = &hdl_adc_ch_iface,
  .dependencies = hdl_module_dependencies(&mod_adc0, &mod_gpio_pa3),
  .config = hdl_module_config(hdl_adc_ch_config_t,
    .channel = ADC_CHANNEL_3,
    .sample_time = ADC_SAMPLETIME_239POINT5,
    .rank = HDL_ADC_CH_RANK_REGULAR1
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

/**************************************************************
 *  UART
 *************************************************************/

 const hdl_uart_mcu_t mod_uart0 = {
  .iface = &hdl_uart_iface,
  .dependencies = hdl_module_dependencies(
    &mod_gpio_pa10_uart_rx,
    &mod_gpio_pa9_uart_tx,
    &mod_clock_apb2,
    &mod_nvic,
    &mod_systick_timer
  ),
  .config = hdl_module_config(hdl_uart_config_t,
    .phy = (uint32_t)USART0, 
    .rcu = RCU_USART0,
    .interrupt = &mod_irq_usart0,
    .baudrate = 115200,
    .word_len = USART_WL_8BIT,
    .parity = USART_PM_NONE,
    .stop_bits = USART_STB_1BIT
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_UART_VAR_SIZE)
};

/*================================================================*/

extern const hdl_interrupt_controller_t mod_ic                    __attribute__ ((alias ("mod_nvic")));

extern const hdl_tick_counter_t mod_tick_counter                  __attribute__ ((alias ("mod_systick_counter")));

extern const hdl_time_counter_t mod_timer_ms                      __attribute__ ((alias ("mod_systick_timer")));

extern const hdl_gpio_pin_t mod_output1_pin                       __attribute__ ((alias ("mod_gpio_pa8")));
extern const hdl_gpio_pin_t mod_output2_pin                       __attribute__ ((alias ("mod_gpio_pa9")));

extern const hdl_gpio_pin_t mod_led1_pin                          __attribute__ ((alias ("mod_gpio_pb12")));
extern const hdl_gpio_pin_t mod_led2_pin                          __attribute__ ((alias ("mod_gpio_pb13")));
extern const hdl_gpio_pin_t mod_led3_pin                          __attribute__ ((alias ("mod_gpio_pb14")));
extern const hdl_gpio_pin_t mod_led4_pin                          __attribute__ ((alias ("mod_gpio_pb15")));
extern const hdl_gpio_pin_t mod_button_pin                        __attribute__ ((alias ("mod_gpio_pa0")));

extern const hdl_uart_t mod_uart                                  __attribute__ ((alias ("mod_uart0")));
extern const hdl_uart_t mod_rs485                                 __attribute__ ((alias ("hdl_null_module")));

extern const hdl_spi_client_ch_t mod_spi_client                   __attribute__ ((alias ("mod_spi0_ch0")));
extern const hdl_i2c_t mod_i2c                                    __attribute__ ((alias ("mod_i2c0")));

#endif
